Tekla Open API Reference for Tekla Structures 2025
Operation.ShowOnlySelected Method
Show Only Selected objects in current view.
 Namespace: Tekla.Structures.Model.Operations
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public static void ShowOnlySelected(
	Operation.UnselectedModeEnum UnselectedMode
)
Public Shared Sub ShowOnlySelected (
	UnselectedMode As Operation.UnselectedModeEnum
)
Parameters
UnselectedMode
Type: Tekla.Structures.Model.Operations.Operation.UnselectedModeEnum
Specify what to do with unselected parts.
See Also
Reference
Operation Class
Tekla.Structures.Model.Operations Namespace